MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4NRFDFG/mcu.h
/**
  * @brief Interrupt Control Registers A
  */
typedef struct
{
  __IO uint8_t  NIC00;             /*!< Non-maskable Interrupt A Control Register 00 */
       uint8_t  RESERVED0[31];
  __IO uint8_t  IMC00;             /*!< Interrupt A Mode Control Register 00         */
  __IO uint8_t  IMC01;             /*!< Interrupt A Mode Control Register 01         */
  __IO uint8_t  IMC02;             /*!< Interrupt A Mode Control Register 02         */
  __IO uint8_t  IMC03;             /*!< Interrupt A Mode Control Register 03         */
  __IO uint8_t  IMC04;             /*!< Interrupt A Mode Control Register 04         */
  __IO uint8_t  IMC05;             /*!< Interrupt A Mode Control Register 05         */
  __IO uint8_t  IMC06;             /*!< Interrupt A Mode Control Register 06         */
  __IO uint8_t  IMC07;             /*!< Interrupt A Mode Control Register 07         */
  __IO uint8_t  IMC08;             /*!< Interrupt A Mode Control Register 08         */
  __IO uint8_t  IMC09;             /*!< Interrupt A Mode Control Register 09         */
  __IO uint8_t  IMC10;             /*!< Interrupt A Mode Control Register 10         */
  __IO uint8_t  IMC11;             /*!< Interrupt A Mode Control Register 11         */
       uint8_t  RESERVED1;
  __IO uint8_t  IMC13;             /*!< Interrupt A Mode Control Register 13         */
       uint8_t  RESERVED2;
  __IO uint8_t  IMC15;             /*!< Interrupt A Mode Control Register 15         */
  __IO uint8_t  IMC16;             /*!< Interrupt A Mode Control Register 16         */
  __IO uint8_t  IMC17;             /*!< Interrupt A Mode Control Register 17         */
  __IO uint8_t  IMC18;             /*!< Interrupt A Mode Control Register 18         */
  __IO uint8_t  IMC19;             /*!< Interrupt A Mode Control Register 19         */
  __IO uint8_t  IMC20;             /*!< Interrupt A Mode Control Register 20         */
  __IO uint8_t  IMC21;             /*!< Interrupt A Mode Control Register 21         */
  __IO uint8_t  IMC22;             /*!< Interrupt A Mode Control Register 22         */
  __IO uint8_t  IMC23;             /*!< Interrupt A Mode Control Register 23         */
       uint8_t  RESERVED3;
  __IO uint8_t  IMC25;             /*!< Interrupt A Mode Control Register 25         */
       uint8_t  RESERVED4;
  __IO uint8_t  IMC27;             /*!< Interrupt A Mode Control Register 27         */
  __IO uint8_t  IMC28;             /*!< Interrupt A Mode Control Register 28         */
  __IO uint8_t  IMC29;             /*!< Interrupt A Mode Control Register 29         */
  __IO uint8_t  IMC30;             /*!< Interrupt A Mode Control Register 30         */
  __IO uint8_t  IMC31;             /*!< Interrupt A Mode Control Register 31         */
       uint8_t  RESERVED5[17];
  __IO uint8_t  IMC49;             /*!< Interrupt A Mode Control Register 49         */
  __IO uint8_t  IMC50;             /*!< Interrupt A Mode Control Register 50         */
  __IO uint8_t  IMC51;             /*!< Interrupt A Mode Control Register 51         */
  __IO uint8_t  IMC52;             /*!< Interrupt A Mode Control Register 52         */
  __IO uint8_t  IMC53;             /*!< Interrupt A Mode Control Register 53         */
  __IO uint8_t  IMC54;             /*!< Interrupt A Mode Control Register 54         */
  __IO uint8_t  IMC55;             /*!< Interrupt A Mode Control Register 55         */
  __IO uint8_t  IMC56;             /*!< Interrupt A Mode Control Register 56         */
  __IO uint8_t  IMC57;             /*!< Interrupt A Mode Control Register 57         */
} TSB_IA_TypeDef;

/**
  * @brief Low speed oscillation/power control/reset
  */
typedef struct
{
  __IO uint8_t  LOSCCR;            /*!< Low speed oscillation and Internal High speed oscillation 2 clock control register*/
  __IO uint8_t  SHTDNOP;           /*!< Power supply cut off control register        */
  __IO uint8_t  RSTFLG0;           /*!< Reset flag register 0                        */
  __IO uint8_t  RSTFLG1;           /*!< Reset flag register 1                        */
       uint8_t  RESERVED0[11];
  __IO uint8_t  PROTECT;           /*!< RLM write protection register                */
} TSB_RLM_TypeDef;

/**
  * @brief LVD0
  */
typedef struct
{
  __IO uint8_t  CR1;               /*!< LVD Control Register1                        */
  __IO uint8_t  CR2;               /*!< LVD Control Register2                        */
  __IO uint8_t  LVL1;              /*!< LVD Detection Voltage Select Register 1      */
       uint8_t  RESERVED0;
  __I  uint8_t  SR;                /*!< LVD Status Register                          */
} TSB_LVD_TypeDef;

/**
  * @brief TRGSEL
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< TRGSEL Control register 0                    */
  __IO uint32_t CR1;               /*!< TRGSEL Control register 1                    */
  __IO uint32_t CR2;               /*!< TSEL Control register 2                      */
  __IO uint32_t CR3;               /*!< TRGSEL Control register 3                    */
  __IO uint32_t CR4;               /*!< TRGSEL Control register 4                    */
  __IO uint32_t CR5;               /*!< TRGSEL Control register 5                    */
  __IO uint32_t CR6;               /*!< TRGSEL Control register 6                    */
  __IO uint32_t CR7;               /*!< TRGSEL Control register 7                    */
  __IO uint32_t CR8;               /*!< TRGSEL Control register 8                    */
  __IO uint32_t CR9;               /*!< TRGSEL Control register 9                    */
  __IO uint32_t CR10;              /*!< TRGSEL Control register 10                   */
  __IO uint32_t CR11;              /*!< TRGSEL Control register 11                   */
  __IO uint32_t CR12;              /*!< TRGSEL Control register 12                   */
  __IO uint32_t CR13;              /*!< TRGSEL Control register 13                   */
  __IO uint32_t CR14;              /*!< TRGSEL Control register 14                   */
} TSB_TSEL_TypeDef;

/**
  * @brief Long Term Timer(LTTMR)
  */
typedef struct
{
  __IO uint8_t  CR0;               /*!< LTTMR Control Register                       */
  __IO uint8_t  VALL;              /*!< LTTMR Data Register (Lower)                  */
  __IO uint8_t  VALH;              /*!< LTTMR Data Register (Upper)                  */
} TSB_LTT_TypeDef;

/**
  * @brief Serial Interface (TSPI)
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< TSPI Control Register 0                      */
  __IO uint32_t CR1;               /*!< TSPI Control Register 1                      */
  __IO uint32_t CR2;               /*!< TSPI Control Register 2                      */
  __IO uint32_t CR3;               /*!< TSPI Control Register 3                      */
  __IO uint32_t BR;                /*!< TSPI Baud Rate Register                      */
  __IO uint32_t FMTR0;             /*!< TSPI Format Control Register 0               */
  __IO uint32_t FMTR1;             /*!< TSPI Format Control Register 1               */
  __IO uint32_t SECTCR0;           /*!< TSPI Sector mode Control Register 0          */
  __IO uint32_t SECTCR1;           /*!< TSPI Sector mode Control Register 1          */
       uint32_t RESERVED0[55];
  __IO uint32_t DR;                /*!< TSPI Data Register                           */
       uint32_t RESERVED1[63];
  __IO uint32_t SR;                /*!< TSPI Status Register                         */
  __IO uint32_t ERR;               /*!< TSPI Error Flag Register                     */
} TSB_TSPI_TypeDef;

/**
  * @brief External Bus Interface(EXB)
  */
typedef struct
{
  __IO uint32_t MOD;               /*!< EBIF Mode Control Register                   */
       uint32_t RESERVED0[3];
  __IO uint32_t AS0;               /*!< EBIF Area and Start Address Configuration Register 0*/
  __IO uint32_t AS1;               /*!< EBIF Area and Start Address Configuration Register 1*/
  __IO uint32_t AS2;               /*!< EBIF Area and Start Address Configuration Register 2*/
  __IO uint32_t AS3;               /*!< EBIF Area and Start Address Configuration Register 3*/
       uint32_t RESERVED1[8];
  __IO uint32_t CS0;               /*!< EBIF Chip Select Control Register 0          */
  __IO uint32_t CS1;               /*!< EBIF Chip Select Control Register 1          */
  __IO uint32_t CS2;               /*!< EBIF Chip Select Control Register 2          */
  __IO uint32_t CS3;               /*!< EBIF Chip Select Control Register 3          */
       uint32_t RESERVED2[4];
  __IO uint32_t CLKCTL;            /*!< EBIF Clock Output Control Register           */
} TSB_EXB_TypeDef;

/**
  * @brief Clock Generator (CG)
  */
typedef struct
{
  __IO uint32_t PROTECT;           /*!< CG write protection register                 */
  __IO uint32_t OSCCR;             /*!< CG Oscillation control register              */
  __IO uint32_t SYSCR;             /*!< CG System clock control register             */
  __IO uint32_t STBYCR;            /*!< CG Standby control register                  */
       uint32_t RESERVED0[4];
  __IO uint32_t PLL0SEL;           /*!< CG PLL selection register for fsys           */
       uint32_t RESERVED1[3];
  __IO uint32_t WUPHCR;            /*!< CG High speed oscillation warming up register*/
  __IO uint32_t WUPLCR;            /*!< CG Low speed oscillation warming up register */
       uint32_t RESERVED2[3];
  __IO uint32_t FSYSMENC;          /*!< CG Middle speed clock supply and stop register C for fsys*/
  __IO uint32_t FSYSMENA;          /*!< CG Middle speed clock supply and stop register A for fsys*/
  __IO uint32_t FSYSMENB;          /*!< CG Middle speed clock supply and stop register B for fsys*/
  __IO uint32_t FSYSENA;           /*!< CG High speed clock supply and stop register A for fsys*/
       uint32_t RESERVED3;
  __IO uint32_t FCEN;              /*!< CG Clock supply and stop register for fc     */
  __IO uint32_t SPCLKEN;           /*!< CG Clock supply for ADC and Trace Register   */
       uint32_t RESERVED4[2];
  __IO uint32_t EXTEND2;           /*!< CG Function extension register 2             */
} TSB_CG_TypeDef;

