MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4NRFDFG/mcu.h
/* Peripheral declaration */
#define TSB_DMACA                  ((   TSB_DMAC_TypeDef *) TSB_DMACA_BASE)
#define TSB_DMACB                  ((   TSB_DMAC_TypeDef *) TSB_DMACB_BASE)
#define TSB_CANAMB0                (( TSB_CANAMB_TypeDef *)TSB_CANAMB0_BASE)
#define TSB_CANAMB1                (( TSB_CANAMB_TypeDef *)TSB_CANAMB1_BASE)
#define TSB_CANAMB2                (( TSB_CANAMB_TypeDef *)TSB_CANAMB2_BASE)
#define TSB_CANAMB3                (( TSB_CANAMB_TypeDef *)TSB_CANAMB3_BASE)
#define TSB_CANAMB4                (( TSB_CANAMB_TypeDef *)TSB_CANAMB4_BASE)
#define TSB_CANAMB5                (( TSB_CANAMB_TypeDef *)TSB_CANAMB5_BASE)
#define TSB_CANAMB6                (( TSB_CANAMB_TypeDef *)TSB_CANAMB6_BASE)
#define TSB_CANAMB7                (( TSB_CANAMB_TypeDef *)TSB_CANAMB7_BASE)
#define TSB_CANAMB8                (( TSB_CANAMB_TypeDef *)TSB_CANAMB8_BASE)
#define TSB_CANAMB9                (( TSB_CANAMB_TypeDef *)TSB_CANAMB9_BASE)
#define TSB_CANAMB10               (( TSB_CANAMB_TypeDef *)TSB_CANAMB10_BASE)
#define TSB_CANAMB11               (( TSB_CANAMB_TypeDef *)TSB_CANAMB11_BASE)
#define TSB_CANAMB12               (( TSB_CANAMB_TypeDef *)TSB_CANAMB12_BASE)
#define TSB_CANAMB13               (( TSB_CANAMB_TypeDef *)TSB_CANAMB13_BASE)
#define TSB_CANAMB14               (( TSB_CANAMB_TypeDef *)TSB_CANAMB14_BASE)
#define TSB_CANAMB15               (( TSB_CANAMB_TypeDef *)TSB_CANAMB15_BASE)
#define TSB_CANAMB16               (( TSB_CANAMB_TypeDef *)TSB_CANAMB16_BASE)
#define TSB_CANAMB17               (( TSB_CANAMB_TypeDef *)TSB_CANAMB17_BASE)
#define TSB_CANAMB18               (( TSB_CANAMB_TypeDef *)TSB_CANAMB18_BASE)
#define TSB_CANAMB19               (( TSB_CANAMB_TypeDef *)TSB_CANAMB19_BASE)
#define TSB_CANAMB20               (( TSB_CANAMB_TypeDef *)TSB_CANAMB20_BASE)
#define TSB_CANAMB21               (( TSB_CANAMB_TypeDef *)TSB_CANAMB21_BASE)
#define TSB_CANAMB22               (( TSB_CANAMB_TypeDef *)TSB_CANAMB22_BASE)
#define TSB_CANAMB23               (( TSB_CANAMB_TypeDef *)TSB_CANAMB23_BASE)
#define TSB_CANAMB24               (( TSB_CANAMB_TypeDef *)TSB_CANAMB24_BASE)
#define TSB_CANAMB25               (( TSB_CANAMB_TypeDef *)TSB_CANAMB25_BASE)
#define TSB_CANAMB26               (( TSB_CANAMB_TypeDef *)TSB_CANAMB26_BASE)
#define TSB_CANAMB27               (( TSB_CANAMB_TypeDef *)TSB_CANAMB27_BASE)
#define TSB_CANAMB28               (( TSB_CANAMB_TypeDef *)TSB_CANAMB28_BASE)
#define TSB_CANAMB29               (( TSB_CANAMB_TypeDef *)TSB_CANAMB29_BASE)
#define TSB_CANAMB30               (( TSB_CANAMB_TypeDef *)TSB_CANAMB30_BASE)
#define TSB_CANAMB31               (( TSB_CANAMB_TypeDef *)TSB_CANAMB31_BASE)
#define TSB_CANBMB0                (( TSB_CANBMB_TypeDef *)TSB_CANBMB0_BASE)
#define TSB_CANBMB1                (( TSB_CANBMB_TypeDef *)TSB_CANBMB1_BASE)
#define TSB_CANBMB2                (( TSB_CANBMB_TypeDef *)TSB_CANBMB2_BASE)
#define TSB_CANBMB3                (( TSB_CANBMB_TypeDef *)TSB_CANBMB3_BASE)
#define TSB_CANBMB4                (( TSB_CANBMB_TypeDef *)TSB_CANBMB4_BASE)
#define TSB_CANBMB5                (( TSB_CANBMB_TypeDef *)TSB_CANBMB5_BASE)
#define TSB_CANBMB6                (( TSB_CANBMB_TypeDef *)TSB_CANBMB6_BASE)
#define TSB_CANBMB7                (( TSB_CANBMB_TypeDef *)TSB_CANBMB7_BASE)
#define TSB_CANBMB8                (( TSB_CANBMB_TypeDef *)TSB_CANBMB8_BASE)
#define TSB_CANBMB9                (( TSB_CANBMB_TypeDef *)TSB_CANBMB9_BASE)
#define TSB_CANBMB10               (( TSB_CANBMB_TypeDef *)TSB_CANBMB10_BASE)
#define TSB_CANBMB11               (( TSB_CANBMB_TypeDef *)TSB_CANBMB11_BASE)
#define TSB_CANBMB12               (( TSB_CANBMB_TypeDef *)TSB_CANBMB12_BASE)
#define TSB_CANBMB13               (( TSB_CANBMB_TypeDef *)TSB_CANBMB13_BASE)
#define TSB_CANBMB14               (( TSB_CANBMB_TypeDef *)TSB_CANBMB14_BASE)
#define TSB_CANBMB15               (( TSB_CANBMB_TypeDef *)TSB_CANBMB15_BASE)
#define TSB_CANBMB16               (( TSB_CANBMB_TypeDef *)TSB_CANBMB16_BASE)
#define TSB_CANBMB17               (( TSB_CANBMB_TypeDef *)TSB_CANBMB17_BASE)
#define TSB_CANBMB18               (( TSB_CANBMB_TypeDef *)TSB_CANBMB18_BASE)
#define TSB_CANBMB19               (( TSB_CANBMB_TypeDef *)TSB_CANBMB19_BASE)
#define TSB_CANBMB20               (( TSB_CANBMB_TypeDef *)TSB_CANBMB20_BASE)
#define TSB_CANBMB21               (( TSB_CANBMB_TypeDef *)TSB_CANBMB21_BASE)
#define TSB_CANBMB22               (( TSB_CANBMB_TypeDef *)TSB_CANBMB22_BASE)
#define TSB_CANBMB23               (( TSB_CANBMB_TypeDef *)TSB_CANBMB23_BASE)
#define TSB_CANBMB24               (( TSB_CANBMB_TypeDef *)TSB_CANBMB24_BASE)
#define TSB_CANBMB25               (( TSB_CANBMB_TypeDef *)TSB_CANBMB25_BASE)
#define TSB_CANBMB26               (( TSB_CANBMB_TypeDef *)TSB_CANBMB26_BASE)
#define TSB_CANBMB27               (( TSB_CANBMB_TypeDef *)TSB_CANBMB27_BASE)
#define TSB_CANBMB28               (( TSB_CANBMB_TypeDef *)TSB_CANBMB28_BASE)
#define TSB_CANBMB29               (( TSB_CANBMB_TypeDef *)TSB_CANBMB29_BASE)
#define TSB_CANBMB30               (( TSB_CANBMB_TypeDef *)TSB_CANBMB30_BASE)
#define TSB_CANBMB31               (( TSB_CANBMB_TypeDef *)TSB_CANBMB31_BASE)
#define TSB_CANA                   ((    TSB_CAN_TypeDef *)  TSB_CANA_BASE)
#define TSB_CANB                   ((    TSB_CAN_TypeDef *)  TSB_CANB_BASE)
#define TSB_EMA                    ((     TSB_EM_TypeDef *)   TSB_EMA_BASE)
#define TSB_SMI0                   ((    TSB_SMI_TypeDef *)  TSB_SMI0_BASE)
#define TSB_IA                     ((     TSB_IA_TypeDef *)    TSB_IA_BASE)
#define TSB_RLM                    ((    TSB_RLM_TypeDef *)   TSB_RLM_BASE)
#define TSB_LVD                    ((    TSB_LVD_TypeDef *)   TSB_LVD_BASE)
#define TSB_TSEL0                  ((   TSB_TSEL_TypeDef *) TSB_TSEL0_BASE)
#define TSB_LTT0                   ((    TSB_LTT_TypeDef *)  TSB_LTT0_BASE)
#define TSB_TSPI0                  ((   TSB_TSPI_TypeDef *) TSB_TSPI0_BASE)
#define TSB_TSPI1                  ((   TSB_TSPI_TypeDef *) TSB_TSPI1_BASE)
#define TSB_TSPI2                  ((   TSB_TSPI_TypeDef *) TSB_TSPI2_BASE)
#define TSB_TSPI3                  ((   TSB_TSPI_TypeDef *) TSB_TSPI3_BASE)
#define TSB_TSPI4                  ((   TSB_TSPI_TypeDef *) TSB_TSPI4_BASE)
#define TSB_TSPI5                  ((   TSB_TSPI_TypeDef *) TSB_TSPI5_BASE)
#define TSB_TSPI6                  ((   TSB_TSPI_TypeDef *) TSB_TSPI6_BASE)
#define TSB_TSPI7                  ((   TSB_TSPI_TypeDef *) TSB_TSPI7_BASE)
#define TSB_TSPI8                  ((   TSB_TSPI_TypeDef *) TSB_TSPI8_BASE)
#define TSB_EXB                    ((    TSB_EXB_TypeDef *)   TSB_EXB_BASE)
#define TSB_CG                     ((     TSB_CG_TypeDef *)    TSB_CG_BASE)
#define TSB_IB                     ((     TSB_IB_TypeDef *)    TSB_IB_BASE)
#define TSB_IMN                    ((    TSB_IMN_TypeDef *)   TSB_IMN_BASE)
#define TSB_DNFA                   ((    TSB_DNF_TypeDef *)  TSB_DNFA_BASE)
#define TSB_DNFB                   ((    TSB_DNF_TypeDef *)  TSB_DNFB_BASE)
#define TSB_SIWD0                  ((   TSB_SIWD_TypeDef *) TSB_SIWD0_BASE)
#define TSB_NBD                    ((    TSB_NBD_TypeDef *)   TSB_NBD_BASE)
#define TSB_MDMAA                  ((   TSB_MDMA_TypeDef *) TSB_MDMAA_BASE)
#define TSB_FURT0                  ((   TSB_FURT_TypeDef *) TSB_FURT0_BASE)
#define TSB_FURT1                  ((   TSB_FURT_TypeDef *) TSB_FURT1_BASE)
#define TSB_ADA                    ((     TSB_AD_TypeDef *)   TSB_ADA_BASE)
#define TSB_DA0                    ((     TSB_DA_TypeDef *)   TSB_DA0_BASE)
#define TSB_DA1                    ((     TSB_DA_TypeDef *)   TSB_DA1_BASE)
#define TSB_T32A0                  ((   TSB_T32A_TypeDef *) TSB_T32A0_BASE)
#define TSB_T32A1                  ((   TSB_T32A_TypeDef *) TSB_T32A1_BASE)
#define TSB_T32A2                  ((   TSB_T32A_TypeDef *) TSB_T32A2_BASE)
#define TSB_T32A3                  ((   TSB_T32A_TypeDef *) TSB_T32A3_BASE)
#define TSB_T32A4                  ((   TSB_T32A_TypeDef *) TSB_T32A4_BASE)
#define TSB_T32A5                  ((   TSB_T32A_TypeDef *) TSB_T32A5_BASE)
#define TSB_T32A6                  ((   TSB_T32A_TypeDef *) TSB_T32A6_BASE)
#define TSB_T32A7                  ((   TSB_T32A_TypeDef *) TSB_T32A7_BASE)
#define TSB_T32A8                  ((   TSB_T32A_TypeDef *) TSB_T32A8_BASE)
#define TSB_T32A9                  ((   TSB_T32A_TypeDef *) TSB_T32A9_BASE)
#define TSB_T32A10                 ((   TSB_T32A_TypeDef *)TSB_T32A10_BASE)
#define TSB_T32A11                 ((   TSB_T32A_TypeDef *)TSB_T32A11_BASE)
#define TSB_T32A12                 ((   TSB_T32A_TypeDef *)TSB_T32A12_BASE)
#define TSB_T32A13                 ((   TSB_T32A_TypeDef *)TSB_T32A13_BASE)
#define TSB_T32A14                 ((   TSB_T32A_TypeDef *)TSB_T32A14_BASE)
#define TSB_T32A15                 ((   TSB_T32A_TypeDef *)TSB_T32A15_BASE)
#define TSB_TSSI0                  ((   TSB_TSSI_TypeDef *) TSB_TSSI0_BASE)
#define TSB_TSSI1                  ((   TSB_TSSI_TypeDef *) TSB_TSSI1_BASE)
#define TSB_UART0                  ((   TSB_UART_TypeDef *) TSB_UART0_BASE)
#define TSB_UART1                  ((   TSB_UART_TypeDef *) TSB_UART1_BASE)
#define TSB_UART2                  ((   TSB_UART_TypeDef *) TSB_UART2_BASE)
#define TSB_UART3                  ((   TSB_UART_TypeDef *) TSB_UART3_BASE)
#define TSB_UART4                  ((   TSB_UART_TypeDef *) TSB_UART4_BASE)
#define TSB_UART5                  ((   TSB_UART_TypeDef *) TSB_UART5_BASE)
#define TSB_I2S0                   ((    TSB_I2S_TypeDef *)  TSB_I2S0_BASE)
#define TSB_I2S1                   ((    TSB_I2S_TypeDef *)  TSB_I2S1_BASE)
#define TSB_I2C0                   ((    TSB_I2C_TypeDef *)  TSB_I2C0_BASE)
#define TSB_I2C1                   ((    TSB_I2C_TypeDef *)  TSB_I2C1_BASE)
#define TSB_I2C2                   ((    TSB_I2C_TypeDef *)  TSB_I2C2_BASE)
#define TSB_I2C3                   ((    TSB_I2C_TypeDef *)  TSB_I2C3_BASE)
#define TSB_I2C4                   ((    TSB_I2C_TypeDef *)  TSB_I2C4_BASE)
#define TSB_EI2C0                  ((   TSB_EI2C_TypeDef *) TSB_EI2C0_BASE)
#define TSB_EI2C1                  ((   TSB_EI2C_TypeDef *) TSB_EI2C1_BASE)
#define TSB_EI2C2                  ((   TSB_EI2C_TypeDef *) TSB_EI2C2_BASE)
#define TSB_EI2C3                  ((   TSB_EI2C_TypeDef *) TSB_EI2C3_BASE)
#define TSB_EI2C4                  ((   TSB_EI2C_TypeDef *) TSB_EI2C4_BASE)
#define TSB_FIRnore                ((    TSB_FIR_TypeDef *)TSB_FIRnore_BASE)
#define TSB_PA                     ((     TSB_PA_TypeDef *)    TSB_PA_BASE)
#define TSB_PB                     ((     TSB_PB_TypeDef *)    TSB_PB_BASE)
#define TSB_PC                     ((     TSB_PC_TypeDef *)    TSB_PC_BASE)
#define TSB_PD                     ((     TSB_PD_TypeDef *)    TSB_PD_BASE)
#define TSB_PE                     ((     TSB_PE_TypeDef *)    TSB_PE_BASE)
#define TSB_PF                     ((     TSB_PF_TypeDef *)    TSB_PF_BASE)
#define TSB_PG                     ((     TSB_PG_TypeDef *)    TSB_PG_BASE)
#define TSB_PH                     ((     TSB_PH_TypeDef *)    TSB_PH_BASE)
#define TSB_PJ                     ((     TSB_PJ_TypeDef *)    TSB_PJ_BASE)
#define TSB_PK                     ((     TSB_PK_TypeDef *)    TSB_PK_BASE)
#define TSB_PL                     ((     TSB_PL_TypeDef *)    TSB_PL_BASE)
#define TSB_PM                     ((     TSB_PM_TypeDef *)    TSB_PM_BASE)
#define TSB_PN                     ((     TSB_PN_TypeDef *)    TSB_PN_BASE)
#define TSB_PP                     ((     TSB_PP_TypeDef *)    TSB_PP_BASE)
#define TSB_PR                     ((     TSB_PR_TypeDef *)    TSB_PR_BASE)
#define TSB_PT                     ((     TSB_PT_TypeDef *)    TSB_PT_BASE)
#define TSB_PU                     ((     TSB_PU_TypeDef *)    TSB_PU_BASE)
#define TSB_PV                     ((     TSB_PV_TypeDef *)    TSB_PV_BASE)
#define TSB_PW                     ((     TSB_PW_TypeDef *)    TSB_PW_BASE)
#define TSB_PY                     ((     TSB_PY_TypeDef *)    TSB_PY_BASE)
#define TSB_TRM                    ((    TSB_TRM_TypeDef *)   TSB_TRM_BASE)
#define TSB_OFD                    ((    TSB_OFD_TypeDef *)   TSB_OFD_BASE)
#define TSB_RTC                    ((    TSB_RTC_TypeDef *)   TSB_RTC_BASE)
#define TSB_CEC0                   ((    TSB_CEC_TypeDef *)  TSB_CEC0_BASE)
#define TSB_RMC0                   ((    TSB_RMC_TypeDef *)  TSB_RMC0_BASE)
#define TSB_RMC1                   ((    TSB_RMC_TypeDef *)  TSB_RMC1_BASE)
#define TSB_PMD0                   ((    TSB_PMD_TypeDef *)  TSB_PMD0_BASE)
#define TSB_ISDA                   ((    TSB_ISD_TypeDef *)  TSB_ISDA_BASE)
#define TSB_ISDB                   ((    TSB_ISD_TypeDef *)  TSB_ISDB_BASE)
#define TSB_ISDC                   ((    TSB_ISD_TypeDef *)  TSB_ISDC_BASE)
#define TSB_USBA                   ((    TSB_USB_TypeDef *)  TSB_USBA_BASE)
#define TSB_USBB                   ((    TSB_USB_TypeDef *)  TSB_USBB_BASE)
#define TSB_FC                     ((     TSB_FC_TypeDef *)    TSB_FC_BASE)


/* Bit-Band for Device Specific Peripheral Registers */
#define BITBAND_OFFSET (0x02000000UL)
#define BITBAND_PERI_BASE (PERI_BASE + BITBAND_OFFSET)
#define BITBAND_PERI(addr, bitnum) (BITBAND_PERI_BASE + (((uint32_t)(addr) - PERI_BASE) << 5) + ((uint32_t)(bitnum) << 2))



/* DMA Controller */
#define TSB_DMACA_INTSTATUS_INTSTATUS0            (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->INTSTATUS,0)))
#define TSB_DMACA_INTSTATUS_INTSTATUS1            (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->INTSTATUS,1)))
#define TSB_DMACA_INTTCSTATUS_INTTCSTATUS0        (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->INTTCSTATUS,0)))
#define TSB_DMACA_INTTCSTATUS_INTTCSTATUS1        (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->INTTCSTATUS,1)))
#define TSB_DMACA_INTERRORSTATUS_INTERRSTATUS0    (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->INTERRORSTATUS,0)))
#define TSB_DMACA_INTERRORSTATUS_INTERRSTATUS1    (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->INTERRORSTATUS,1)))
#define TSB_DMACA_RAWINTTCSTATUS_RAWINTTCS0       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->RAWINTTCSTATUS,0)))
#define TSB_DMACA_RAWINTTCSTATUS_RAWINTTCS1       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->RAWINTTCSTATUS,1)))
#define TSB_DMACA_RAWINTERRORSTATUS_RAWINTERRS0   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->RAWINTERRORSTATUS,0)))
#define TSB_DMACA_RAWINTERRORSTATUS_RAWINTERRS1   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->RAWINTERRORSTATUS,1)))
#define TSB_DMACA_ENBLDCHNS_ENABLEDCH0            (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->ENBLDCHNS,0)))
#define TSB_DMACA_ENBLDCHNS_ENABLEDCH1            (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->ENBLDCHNS,1)))
#define TSB_DMACA_CONFIGURATION_E                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->CONFIGURATION,0)))
#define TSB_DMACA_C0CONTROL_SI                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CONTROL,26)))
#define TSB_DMACA_C0CONTROL_DI                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CONTROL,27)))
#define TSB_DMACA_C0CONTROL_I                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CONTROL,31)))
#define TSB_DMACA_C0CONFIGURATION_E               (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CONFIGURATION,0)))
#define TSB_DMACA_C0CONFIGURATION_IE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CONFIGURATION,14)))
#define TSB_DMACA_C0CONFIGURATION_ITC             (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CONFIGURATION,15)))
#define TSB_DMACA_C0CONFIGURATION_LOCK            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CONFIGURATION,16)))
#define TSB_DMACA_C0CONFIGURATION_ACTIVE          (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CONFIGURATION,17)))
#define TSB_DMACA_C0CONFIGURATION_HALT            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C0CONFIGURATION,18)))
#define TSB_DMACA_C1CONTROL_SI                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONTROL,26)))
#define TSB_DMACA_C1CONTROL_DI                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONTROL,27)))
#define TSB_DMACA_C1CONTROL_I                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONTROL,31)))
#define TSB_DMACA_C1CONFIGURATION_E               (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONFIGURATION,0)))
#define TSB_DMACA_C1CONFIGURATION_IE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONFIGURATION,14)))
#define TSB_DMACA_C1CONFIGURATION_ITC             (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONFIGURATION,15)))
#define TSB_DMACA_C1CONFIGURATION_LOCK            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONFIGURATION,16)))
#define TSB_DMACA_C1CONFIGURATION_ACTIVE          (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONFIGURATION,17)))
#define TSB_DMACA_C1CONFIGURATION_HALT            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACA->C1CONFIGURATION,18)))

#define TSB_DMACB_INTSTATUS_INTSTATUS0            (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->INTSTATUS,0)))
#define TSB_DMACB_INTSTATUS_INTSTATUS1            (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->INTSTATUS,1)))
#define TSB_DMACB_INTTCSTATUS_INTTCSTATUS0        (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->INTTCSTATUS,0)))
#define TSB_DMACB_INTTCSTATUS_INTTCSTATUS1        (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->INTTCSTATUS,1)))
#define TSB_DMACB_INTERRORSTATUS_INTERRSTATUS0    (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->INTERRORSTATUS,0)))
#define TSB_DMACB_INTERRORSTATUS_INTERRSTATUS1    (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->INTERRORSTATUS,1)))
#define TSB_DMACB_RAWINTTCSTATUS_RAWINTTCS0       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->RAWINTTCSTATUS,0)))
#define TSB_DMACB_RAWINTTCSTATUS_RAWINTTCS1       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->RAWINTTCSTATUS,1)))
#define TSB_DMACB_RAWINTERRORSTATUS_RAWINTERRS0   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->RAWINTERRORSTATUS,0)))
#define TSB_DMACB_RAWINTERRORSTATUS_RAWINTERRS1   (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->RAWINTERRORSTATUS,1)))
#define TSB_DMACB_ENBLDCHNS_ENABLEDCH0            (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->ENBLDCHNS,0)))
#define TSB_DMACB_ENBLDCHNS_ENABLEDCH1            (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->ENBLDCHNS,1)))
#define TSB_DMACB_CONFIGURATION_E                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->CONFIGURATION,0)))
#define TSB_DMACB_C0CONTROL_SI                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CONTROL,26)))
#define TSB_DMACB_C0CONTROL_DI                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CONTROL,27)))
#define TSB_DMACB_C0CONTROL_I                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CONTROL,31)))
#define TSB_DMACB_C0CONFIGURATION_E               (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CONFIGURATION,0)))
#define TSB_DMACB_C0CONFIGURATION_IE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CONFIGURATION,14)))
#define TSB_DMACB_C0CONFIGURATION_ITC             (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CONFIGURATION,15)))
#define TSB_DMACB_C0CONFIGURATION_LOCK            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CONFIGURATION,16)))
#define TSB_DMACB_C0CONFIGURATION_ACTIVE          (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CONFIGURATION,17)))
#define TSB_DMACB_C0CONFIGURATION_HALT            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C0CONFIGURATION,18)))
#define TSB_DMACB_C1CONTROL_SI                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONTROL,26)))
#define TSB_DMACB_C1CONTROL_DI                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONTROL,27)))
#define TSB_DMACB_C1CONTROL_I                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONTROL,31)))
#define TSB_DMACB_C1CONFIGURATION_E               (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONFIGURATION,0)))
#define TSB_DMACB_C1CONFIGURATION_IE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONFIGURATION,14)))
#define TSB_DMACB_C1CONFIGURATION_ITC             (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONFIGURATION,15)))
#define TSB_DMACB_C1CONFIGURATION_LOCK            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONFIGURATION,16)))
#define TSB_DMACB_C1CONFIGURATION_ACTIVE          (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONFIGURATION,17)))
#define TSB_DMACB_C1CONFIGURATION_HALT            (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMACB->C1CONFIGURATION,18)))


/* CAN Controller Mailbox RAM (CANMB) */
#define TSB_CANAMB0_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB0->ID,29)))
#define TSB_CANAMB0_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB0->ID,30)))
#define TSB_CANAMB0_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB0->ID,31)))
#define TSB_CANAMB0_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB0->TSVMCF,4)))

